uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
// test_stm32f4_reset - the reference bench suite for the STM32F4's
// FAILING half: stm32f4/reset.hpp (the RCC's reset flags, the
// independent watchdog, the system window watchdog, the four fault
// vectors of this core and the panic breadcrumb across a real reset).
// The running half - the critical section, the timebase, delay_us, the
// clock tree - is test_stm32f4_platform's.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE. The console is the board's own serial bridge and
// every clock this suite measures is inside the chip.
//
// What is exercised, letter by letter:
//   a  the boot story: the reset flags read as the ACCUMULATING history
//      they are, the LSI witness, the WWDG at rest and the two debug
//      freeze bits a debugger may have left standing
//   b  the IWDG WITHOUT EVER STARTING IT - the keyed registers, the two
//      update bits crossing into the LSI domain, and what the LSI's own
//      startup costs
//   c  the WWDG WITHOUT EVER ACTIVATING IT - the free-running counter,
//      the window predicate, EWIF at 0x40 and the early-wakeup
//      interrupt, all with WDGA clear
//   d  the four fault vectors WITHOUT FAULTING - the three configurable
//      faults' enables, the two CCR traps, the status registers
//
//   i  (by name only) SEVEN REAL RESETS. This letter reboots the board
//      once per leg and resumes from a .noinit token, so it is NOT in
//      `z`: `z` has to be one console session a tool can judge from a
//      single capture. Run it with
//          brio run <board> i --app test_stm32f4_reset
//                  --expect="fail" --timeout 120
//      Legs: a software reset, an IWDG time-out (which measures the real
//      one and with it LSI), a WWDG window violation, a panic through
//      ResetReporter, a deliberate HardFault through hard_fault_reset(),
//      a UsageFault with the fault enabled and its record read, and a
//      WWDG time-out with the early warning armed.
//
// NOTHING IN `z` STARTS A WATCHDOG, and that is a measurement rather
// than an oversight. Starting either is one-way in software (RM0090
// 21.3, 22.3), so no letter of `z` starts one at all - the whole of
// chapter 22's timing is reachable with WDGA clear, and chapter 21's
// keyed registers with the start key never written. Letter i does start
// both, on legs that are about to be reset by them.
//
// build: boards = f429zi,f446re,f411ce
// build: monitor_speed = 115200

#include <stdint.h>

#include <optional>

#include "kernel/panic.hpp"
#include "stm32f4/clock.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/reset.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

// ---------------------------------------------------------------------------
// The token letter i lives in
//
// INLINE, and in .noinit, for the two reasons the other strata's suites
// give: the section must survive the crt (the linker script marks
// .noinit NOLOAD and startup neither loads nor zeroes it), and gcc gives
// an inline variable with a section attribute a COMDAT group where a
// plain one gets none - the platform's own panic_record_ is a static
// inline member, so this must be inline too or the link fails with a
// section type conflict.
//
// Its magic word is not decoration: RM0090 promises nothing about SRAM
// across a reset, so every read of this object is guarded.
// ---------------------------------------------------------------------------
inline constexpr uint16_t token_magic = 0xF429;
inline constexpr uint16_t token_canary = 0xC3A5;

/// What the IWDG's own reset did to it - the question leg 2 answers by
/// sitting still, and the state machine that survives EITHER answer
/// (a wait that never returns is itself the measurement).
enum class Quiet : uint8_t {
    untried = 0,   ///< the silence has not been attempted yet
    trying = 1,    ///< banked just before it: a boot that finds this died in it
    survived = 2,  ///< three time-outs passed with nothing refreshing
    bitten = 3,    ///< the watchdog reset the board again during the silence
};

struct Token {
    uint16_t magic;
    uint16_t canary;
    uint8_t leg;        ///< which reset we are waiting for (0 = none pending)
    uint8_t code;       ///< the PanicCode written before the reset
    uint8_t context;    ///< its context byte
    uint16_t pass;      ///< letter i's tally so far
    uint16_t fail;
    uint32_t flags_before;   ///< the flags standing when the leg started
    uint32_t elapsed_ms;     ///< the IWDG leg's own stopwatch
    Quiet quiet;             ///< leg 2: the silence after the watchdog's reset
    uint8_t armed;           ///< leg 2: what Iwdg::arm() answered
    uint8_t armed_running;   ///< leg 2: Iwdg::running() with the watchdog live
    uint8_t ewi_seen;        ///< leg 7: did the early warning fire?
    uint8_t ewi_counter;     ///< and what the counter read inside its handler
    uint32_t fault_cfsr;     ///< legs 5 and 6: the wreck, read in the handler
    uint32_t fault_hfsr;
    uint32_t fault_address;
};
[[gnu::section(".noinit")]] inline Token token;


namespace {

using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial> bench;

// What this boot was told, sampled once in main() before anything can
// disturb it.
uint32_t boot_flags = 0;
std::optional<PanicRecord> boot_record;
bool boot_lsi_on = false;        ///< LSION as the boot found it
bool boot_lsi_ready = false;     ///< LSIRDY as the boot found it
bool boot_wwdg_clocked = false;  ///< RCC_APB1ENR.WWDGEN as the boot found it
uint32_t boot_shcsr = 0;         ///< the three configurable faults' enables
FaultRecord boot_fault{};        ///< CFSR/HFSR as the boot found them

/// Set when letter i's second leg has left a watchdog running that its
/// own reset did not stop: from then on the console loop feeds it, so
/// the remaining legs measure what they mean to measure.
bool feed_iwdg = false;

