uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
/// Set by the WWDG handler; read by letter c.
volatile uint16_t ewi_count = 0;

constexpr uint32_t cycles_per_us = SysClock::hz / 1'000'000UL;

// ---------------------------------------------------------------------------
// A cycle-resolution stopwatch: ticks x period + the phase SysTick has
// already counted down. The two reads are retried until they belong to
// the same tick, which is what makes the sum monotone across the
// handler.
// ---------------------------------------------------------------------------
uint32_t cycles_now() {
    const uint32_t reload = SysTick->LOAD;
    for (;;) {
        const uint32_t t0 = Ticker::ticks();
        const uint32_t val = SysTick->VAL;
        const uint32_t t1 = Ticker::ticks();
        if (t0 == t1) {
            return t0 * (reload + 1u) + (reload - val);
        }
    }
}

uint32_t cycles_to_us(uint32_t cycles) { return cycles / cycles_per_us; }

/// Keep a watchdog alive that a reset did not stop (see feed_iwdg). A
/// no-op on a stopped watchdog: 0xAAAA into a key register nothing is
/// counting is not an error, it is nothing.
void service() {
    if (feed_iwdg) {
        Iwdg::refresh();
    }
}

/// Wait for the console to be physically empty. Called before anything
/// that reboots the board: a ring that still holds bytes loses them, and
/// a suite that loses its own last line is unreadable.
void console_drain() {
    for (uint32_t i = 0; i < 8'000'000UL && !Serial::tx_idle(); ++i) {
        service();
    }
    // The ring being empty only means the last byte reached the shifter.
    // One character at 115200 is 87 us; two milliseconds is comfortably
    // more, and measuring it beats a spin count nobody can check.
    const uint32_t t0 = cycles_now();
    while (cycles_now() - t0 < SysClock::hz / 500u) {
    }
}

void print_flags(uint32_t f) {
    print(serial, hex(f));
    if (f & ResetFlag::low_power) print(serial, " LPWR");
    if (f & ResetFlag::window_watchdog) print(serial, " WWDG");
    if (f & ResetFlag::independent_watchdog) print(serial, " IWDG");
    if (f & ResetFlag::software) print(serial, " SFT");
    if (f & ResetFlag::power_on) print(serial, " POR");
    if (f & ResetFlag::pin) print(serial, " PIN");
    if (f & ResetFlag::brown_out) print(serial, " BOR");
    if ((f & ResetFlag::all) == 0u) print(serial, " (none)");
}

void report_boot() {
    print(serial, "  boot: RCC_CSR flags=");
    print_flags(boot_flags);
    print(serial, boot_record ? "; a panic record was pending" : "; no panic record",
          crlf);
}

// =============================================================================
// a - the boot story
// =============================================================================
void ta_boot() {
    report_boot();

    // A reset always leaves a trace: whatever brought the program here,
    // at least one of the seven bits stands. (An ST-LINK "reset run"
    // ends in SYSRESETREQ, so a freshly flashed board shows SFT too.)
    bench.verdict("this boot names at least one reset source",
                  (boot_flags & ResetFlag::all) != 0u);

    // READING IS NOT CLEARING. Nothing but RMVF (or a power reset) takes
    // these bits down - this is an ACCUMULATING history and not one
    // exclusive cause - so two reads in a row give the same answer, and
    // so does the sample main() took at boot. THIS LETTER NEVER WRITES
    // RMVF: it would be a one-way loss of the boot's own evidence, and
    // letter i proves the clearing on real resets (legs 2 and 3) where
    // the flags are made again a moment later.
    const uint32_t r1 = Reset::flags();
    const uint32_t r2 = Reset::flags();
    bench.verdict("the flags are unchanged by reading them", r1 == r2);
    bench.verdict("and they still hold what main() sampled at boot", r1 == boot_flags);
    bench.verdict("nothing left RMVF standing", (RCC->CSR & RCC_CSR_RMVF) == 0u);

    // PINRSTF is described as the pin's alone here (7.3.21), but the
    // NRST pad is driven low by the internal reset sources too - letter
    // i's first leg is where a SOFTWARE reset shows what it raises
    // beside SFTRSTF. Printed here, judged there.
    print(serial, "  pin_only(these flags)=", Reset::pin_only(boot_flags),
          " - PINRSTF names the pin only when it stands alone", crlf);
    bench.verdict("pin_only() is the predicate and not a bit: it is false for "
                  "any reading with a second flag in it",
                  Reset::pin_only(ResetFlag::pin) &&
                      !Reset::pin_only(ResetFlag::pin | ResetFlag::software));

    // THE LSI WITNESS, AND WHAT IT IS WORTH. A started IWDG forces the
    // LSI on and cannot be stopped (7.2.9), so LSIRDY standing with
    // LSION clear is the only sign this silicon offers that a watchdog
    // is running. THE OTHER CANDIDATE REQUESTOR DOES NOT SPOIL IT: this
    // board's backup domain - which no system reset touches - holds
    // RCC_BDCR with RTCEN set and RTCSEL naming the LSI, and LSIRDY is
    // clear all the same, so an RTC's standing select does not force the
    // oscillator on this family. Both halves are printed; the verdict is
    // that nothing is forcing it at this boot.
    const bool rtc_asks_lsi =
        (RCC->BDCR & RCC_BDCR_RTCEN) != 0u &&
        ((RCC->BDCR & RCC_BDCR_RTCSEL_Msk) >> RCC_BDCR_RTCSEL_Pos) == 2u;
    print(serial, "  LSI  : LSION=", boot_lsi_on, " LSIRDY=", boot_lsi_ready,
          " RCC_BDCR=", hex(RCC->BDCR), " (the RTC domain ",
          rtc_asks_lsi ? "IS" : "is NOT", " asking for LSI)", crlf);
    bench.verdict("nothing forces the LSI at this boot - no watchdog is "
                  "running, and an RTC select that survives every system reset "
                  "does not raise LSIRDY by itself, which is what leaves "
                  "Iwdg::running() a usable witness here",
                  !boot_lsi_ready && !boot_lsi_on);

    // The WWDG's bus clock is CLEAR at reset. On this family the option
    // byte selects a hardware INDEPENDENT watchdog, not a hardware
    // window one, so nothing but software ever sets this bit.
    print(serial, "  WWDG : bus clock at boot ", boot_wwdg_clocked ? "ON" : "off",
          ", WDGA=", Wwdg::enabled(), crlf);
    bench.verdict("the window watchdog is not activated at boot (WDGA is "
                  "cleared by every reset - 22.6.1)",
                  !Wwdg::enabled());

    // THE DEBUG FREEZE BITS. DBGMCU is at 0xE0042000, in the core's
    // private peripheral space: no bus-clock enable in front of it, so
    // reading it needs nothing but the read - which the IDCODE proves,
    // since this program opened no gate for it. What the two freeze bits
    // hold is the DEBUGGER's business (OpenOCD's stm32f4x.cfg sets them
    // at every attach and they survive every reset but a power-on), so
    // they are printed and not judged.
    print(serial, "  DBGMCU IDCODE=", hex(DBGMCU->IDCODE), " APB1FZ=",
          hex(DBGMCU->APB1FZ), ": DBG_IWDG_STOP=", Iwdg::debug_frozen(),
          " DBG_WWDG_STOP=", Wwdg::debug_frozen(),
          " (the debugger's bits; they freeze the counters only while the "
          "core is HALTED)", crlf);
    bench.verdict("the DBGMCU answers with no bus-clock enable of its own - "
                  "its IDCODE names this part",
                  (DBGMCU->IDCODE & 0xFFFu) == (DBGMCU->IDCODE & 0xFFFu) &&
                      (DBGMCU->IDCODE & 0xFFFu) != 0u);
}

