uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
// =============================================================================
// b - the IWDG, never started
// =============================================================================
//
// 21.3.2's write protection has nothing to do with the start key, so PR
// and RLR can be written by a program that has no intention of arming
// anything - and this letter does exactly that, which is what keeps a
// one-way switch out of `z`.
//
// WHAT IT FOUND, and no chapter says it: with the watchdog STOPPED the
// keyed writes are accepted and each raises its own update bit, and THE
// UPDATE NEVER COMPLETES - the bit stands for ever and the register
// keeps reporting its old value. 7.2.9 is where the reason hides: "If
// the independent watchdog is started ... the LSI oscillator is forced
// ON ... After the LSI oscillator temporization, THE CLOCK IS PROVIDED
// TO THE IWDG". So LSION buys nothing: the logic that performs the
// update has no clock until the start key is written. That is why this
// driver's arm() starts before it configures - the completing half is
// proven in letter i, whose second leg arms a NON-DEFAULT setting and is
// reset by it at exactly the time that setting predicts.
//
// THE UPDATE BITS ARE SINGLE-USE PER BOOT here, since nothing can clear
// them while the watchdog is stopped: this letter therefore writes RLR
// and nothing else, and uses the still-clear PVU as the witness for the
// key discipline, so that a second run in the same power cycle judges
// exactly the same things.
void tb_iwdg() {
    // The LSI first, and timed: the datasheets give 15 us typical, 40 us
    // maximum for the startup, which is the only part of this letter
    // that is a physical measurement.
    Rcc::lsi_enable(false);
    const uint32_t c0 = cycles_now();
    Rcc::lsi_enable(true);
    const bool lsi_up = Rcc::lsi_wait_ready();
    const uint32_t lsi_us = cycles_to_us(cycles_now() - c0);
    print(serial, "  LSI started in ", lsi_us, " us (the datasheet's LSI table: "
          "15 us typical, 40 us max)", crlf);
    bench.verdict("the LSI comes up when LSION asks for it", lsi_up);
    bench.verdict("and it takes the datasheet's tens of microseconds, not "
                  "milliseconds",
                  lsi_us < 1000u);

    // ---- the key is required ---------------------------------------------
    // 21.3.2: PR and RLR are writable only after 0x5555, and any other
    // key value closes the window again - the 0xAAAA refresh included.
    // A refresh, then a bare store, then the register's own update bit
    // as the witness that nothing moved.
    Iwdg::refresh();
    const uint32_t sr_before = Iwdg::status();
    IWDG->PR = 5u;                      // no unlock: this must land nowhere
    const uint32_t sr_locked = Iwdg::status();
    print(serial, "  a bare PR store after a refresh: SR ", hex(sr_before), " -> ",
          hex(sr_locked), " (PVU must stay clear)", crlf);
    bench.verdict("a protected write made without the 0x5555 key raises no "
                  "update at all - the refresh re-locked the window (21.3.2)",
                  sr_locked == sr_before && (sr_locked & IWDG_SR_PVU_Msk) == 0u);

    // ---- one keyed write, timed from both ends ---------------------------
    Iwdg::unlock();
    const uint32_t c1 = cycles_now();
    IWDG->RLR = 0x0ABCu;
    uint32_t set_us = 0;
    while ((IWDG->SR & IWDG_SR_RVU_Msk) == 0u) {
        set_us = cycles_to_us(cycles_now() - c1);
        if (set_us > 2000u) {
            break;
        }
    }
    const bool bit_appeared = (IWDG->SR & IWDG_SR_RVU_Msk) != 0u;
    const uint32_t c2 = cycles_now();
    const bool completed = Iwdg::sync(IWDG_SR_RVU_Msk);
    const uint32_t waited_ms = cycles_to_us(cycles_now() - c2) / 1000u;

    print(serial, "  a keyed RLR write raised RVU after ", set_us, " us and it ",
          completed ? "cleared" : "was STILL STANDING", " after ", waited_ms,
          " ms of bounded wait", crlf);
    bench.verdict("a keyed write raises its own update bit in IWDG_SR",
                  bit_appeared);
    // MEASURED, and the opposite of what a domain crossing invites one
    // to expect: the bit is raised BY THE STORE, so the read right after
    // it already sees the bit. Only the CLEARING waits for a clock.
    bench.verdict("and it raises it at once - the read right after the store "
                  "already sees it, so only the CLEARING waits for a clock",
                  set_us <= 2u);
    // THE FINDING.
    bench.verdict("the update NEVER completes while the watchdog is stopped: "
                  "the LSI running is not enough, because the clock reaches "
                  "the IWDG only at the start key (7.2.9)",
                  !completed);
    print(serial, "  RLR reads back ", hex(Iwdg::reload()), " (0xABC written), SR=",
          hex(Iwdg::status()), crlf);
    bench.verdict("and the register keeps reporting its OLD value, since the "
                  "read comes from the VDD domain (21.4.3's Note)",
                  Iwdg::reload() == 0x0FFFu);

    // configure() on the same stopped watchdog: it must SAY SO instead
    // of hanging, which is the whole reason its waits are bounded.
    const uint32_t c3 = cycles_now();
    const bool cfg_ok = Iwdg::configure(IwdgConfig{IwdgPrescaler::div64, 0x0777});
    const uint32_t cfg_ms = cycles_to_us(cycles_now() - c3) / 1000u;
    print(serial, "  configure(/64, 0x777) on a stopped watchdog -> ", cfg_ok,
          " after ", cfg_ms, " ms; PR=", Iwdg::prescaler_bits(), " RLR=",
          hex(Iwdg::reload()), " (that setting would be ",
          iwdg_nominal_ms(IwdgPrescaler::div64, 0x0777), " ms at 32 kHz)", crlf);
    bench.verdict("configure() answers false in bounded time rather than "
                  "hanging, and the registers are untouched - arm(), which "
                  "starts first, is the only order that works here",
                  !cfg_ok && cfg_ms < 3000u && Iwdg::reload() == 0x0FFFu);

    // ---- what is refused --------------------------------------------------
    bench.verdict("a reload wider than twelve bits is refused",
                  !Iwdg::configure(IwdgConfig{IwdgPrescaler::div4, 0x1000}));
    bench.verdict("a reload of ZERO is not (it is table 107's min column, the "
                  "shortest time-out the part has, and force_reset() is what "
                  "uses it)",
                  iwdg_config_valid(IwdgConfig{IwdgPrescaler::div4, 0}));

    // ---- the arithmetic against RM0090 table 107 --------------------------
    print(serial, "  table 107 at 32 kHz: /4 x 0xFFF = ",
          iwdg_nominal_ms(IwdgPrescaler::div4, 0x0FFF), " ms, /256 x 0xFFF = ",
          iwdg_nominal_ms(IwdgPrescaler::div256, 0x0FFF), " ms", crlf);
    bench.verdict("iwdg_nominal_ms reproduces table 107's max column",
                  iwdg_nominal_ms(IwdgPrescaler::div4, 0x0FFF) == 512u &&
                      iwdg_nominal_ms(IwdgPrescaler::div256, 0x0FFF) == 32768u);

    // The watchdog was never started, so this letter leaves the board
    // exactly as it found it but for the LSI, which letter i needs off
    // to read its witness.
    bench.verdict("nothing here started the watchdog: the LSI is on because "
                  "THIS letter asked for it, and Iwdg::running() says so",
                  !Iwdg::running() && Rcc::lsi_enabled());
    Rcc::lsi_enable(false);
}

