uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
// =============================================================================
// c - the WWDG, never activated
// =============================================================================
//
// 22.3 says the down-counter is free-running "even if the watchdog is
// disabled", and 22.6.3 says EWIF is set at 0x40 "also if the interrupt
// is not enabled". Taken together they make the whole timing path of
// this chapter measurable with WDGA never written - which is what this
// letter does, so that a reference suite carries no one-way switch.
void tc_wwdg() {
    constexpr uint32_t pclk1 = SysClock::pclk1_hz;

    // The closed gate first: a peripheral without its bus clock does not
    // answer. Printed, not judged: a claim the silicon may honour by
    // luck is no verdict.
    Wwdg::bus_clock(false);
    const uint32_t dark_cr = WWDG->CR;
    Wwdg::bus_clock(true);
    print(serial, "  CR through a closed clock gate: ", hex(dark_cr),
          ", with the gate open: ", hex(Wwdg::cr()), crlf);
    bench.verdict("the bus clock enables and reads back", Wwdg::bus_clock());
    bench.verdict("WDGA is clear: this letter never activates the watchdog",
                  !Wwdg::enabled());

    // CFR readback. Nothing here is enable-protected and nothing
    // synchronizes: both registers are on PCLK1.
    constexpr WwdgConfig cfg{
        .prescaler = WwdgPrescaler::div8,
        .window = 0x5A,
        .early_wakeup = false,
    };
    bench.verdict("configure() accepts a legal window", Wwdg::configure(cfg));
    print(serial, "  CFR=", hex(Wwdg::cfr()), " WDGTB=",
          static_cast<uint32_t>(Wwdg::prescaler()), " W=", hex(Wwdg::window()),
          " EWI=", Wwdg::early_wakeup_enabled(), crlf);
    bench.verdict("WDGTB and W read back",
                  Wwdg::prescaler() == WwdgPrescaler::div8 && Wwdg::window() == 0x5Au);
    bench.verdict("a window below 0x40 is refused (no refresh could ever be "
                  "legal - Wwdg::force_reset() is the deliberate spelling)",
                  !Wwdg::configure(WwdgConfig{WwdgPrescaler::div1, 0x3F}));
    bench.verdict("and a window wider than seven bits is refused",
                  !Wwdg::configure(WwdgConfig{WwdgPrescaler::div1, 0x80}));

    // THE FREE-RUNNING COUNTER, and the WINDOW PREDICATE with it. At /8
    // a step is 4096 x 8 / PCLK1; from 0x7F the counter needs 0x7F -
    // 0x5A = 37 steps to enter the window, and in_window() is what says
    // it has.
    Wwdg::refresh(0x7F);
    const uint8_t c_start = Wwdg::counter();
    const bool closed_at_once = !Wwdg::in_window();
    const uint32_t w0 = cycles_now();
    uint32_t open_us = 0;
    uint8_t c_open = 0;
    while (cycles_now() - w0 < SysClock::hz / 10u) {   // 100 ms at most
        if (Wwdg::in_window()) {
            open_us = cycles_to_us(cycles_now() - w0);
            c_open = Wwdg::counter();
            break;
        }
    }
    const uint8_t c_later = Wwdg::counter();
    print(serial, "  T went ", hex(c_start), " -> ", hex(c_later),
          " with WDGA CLEAR; the window opened after ", open_us, " us at T=",
          hex(c_open), " (", wwdg_timeout_us(pclk1, WwdgPrescaler::div8, 0x7F) -
                             wwdg_timeout_us(pclk1, WwdgPrescaler::div8, 0x5A),
          " us due for 37 steps)", crlf);
    bench.verdict("the down-counter free-runs with the watchdog disabled "
                  "(22.3), which is what makes this letter safe",
                  c_later < c_start);
    bench.verdict("in_window() is false above the window and true inside it, "
                  "at the counter value the window names",
                  closed_at_once && c_open != 0u && c_open <= 0x5Au && c_open > 0x3Fu);

    // EWIF AT 0x40, TIMED, at two prescalers. From 0x7F the flag is due
    // 63 steps later; the prediction is the chapter's own formula - and
    // table 109's, which 22.4's worked example contradicts (the example
    // prints a quarter of what its own formula gives).
    const auto time_ewif = [](WwdgPrescaler p) -> uint32_t {
        (void)Wwdg::configure(WwdgConfig{p, 0x7F, false});
        Wwdg::clear_flag();
        Wwdg::refresh(0x7F);
        const uint32_t t0 = cycles_now();
        while (!Wwdg::flag()) {
            if (cycles_now() - t0 > SysClock::hz) {   // one second: give up
                return 0;
            }
        }
        const uint32_t took = cycles_now() - t0;
        Wwdg::clear_flag();
        return cycles_to_us(took);
    };
    const uint32_t ewif1 = time_ewif(WwdgPrescaler::div1);
    const uint32_t ewif8 = time_ewif(WwdgPrescaler::div8);
    // THE STEP IS PCLK1'S, NOT THE CORE'S - this family's APB1 runs at a
    // quarter of HCLK at the top of the ladder, and a WWDG prediction
    // made on the core clock is out by that factor.
    const uint32_t step1 = wwdg_step_cycles(WwdgPrescaler::div1) / (pclk1 / 1'000'000u);
    const uint32_t step8 = wwdg_step_cycles(WwdgPrescaler::div8) / (pclk1 / 1'000'000u);
    // wwdg_timeout_us() gives the time to the RESET, T[5:0] + 1 = 64
    // steps from 0x7F; the WARNING is one step before it.
    const uint32_t due1 = wwdg_timeout_us(pclk1, WwdgPrescaler::div1, 0x7F) - step1;
    const uint32_t due8 = wwdg_timeout_us(pclk1, WwdgPrescaler::div8, 0x7F) - step8;
    print(serial, "  EWIF from 0x7F: ", ewif1, " us at /1 (", due1,
          " due, 63 steps), ", ewif8, " us at /8 (", due8,
          " due); one step is ", step1, " and ", step8, " us at PCLK1 = ", pclk1,
          " Hz, and the reset would follow one step later", crlf);
    bench.verdict("EWIF is raised at 0x40 with WDGA CLEAR and the interrupt "
                  "disabled (22.6.3), 63 steps after a refresh",
                  ewif1 != 0u && ewif8 != 0u);
    // THE BAND IS ONE STEP WIDE EITHER WAY, and 22.3 says why: the
    // timing "varies between a minimum and a maximum value due to the
    // unknown status of the prescaler when writing to the WWDG_CR
    // register" - the write lands mid-step, so the first decrement comes
    // early or late by whatever is left of it. Measured, it lands
    // exactly on 63 steps at /8 and one step late at /1.
    bench.verdict("and it lands within one step of the 63 due at both "
                  "prescalers - the slack is 22.3's own unknown prescaler "
                  "phase, and table 109's arithmetic is the one that holds",
                  ewif1 + step1 >= due1 && ewif1 <= due1 + step1 + 200u &&
                      ewif8 + step8 >= due8 && ewif8 <= due8 + step8 + 200u);

