uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
    // rc_w0: the flag is cleared by writing ZERO, which is the opposite
    // discipline to every write-one-to-clear register in this stratum.
    Wwdg::refresh(0x41);   // one step from the warning
    const uint32_t c1 = cycles_now();
    while (!Wwdg::flag() && cycles_now() - c1 < SysClock::hz) {
    }
    const bool flag_up = Wwdg::flag();
    WWDG->SR = WWDG_SR_EWIF;                 // writing ONE has no effect
    const bool survived_one = Wwdg::flag();
    Wwdg::clear_flag();                      // writing ZERO clears it
    const bool cleared_zero = !Wwdg::flag();
    bench.verdict("EWIF stands after a write of ONE (22.6.3: rc_w0, and writing "
                  "1 has no effect)",
                  flag_up && survived_one);
    bench.verdict("and it is cleared by a write of ZERO", cleared_zero);

    // THE INTERRUPT ITSELF, still with WDGA clear. 22.2's feature list
    // says the early wake-up is "triggered (if enabled and the watchdog
    // activated)" while 22.6.2's bit description says only "when set, an
    // interrupt occurs whenever the counter reaches the value 0x40" -
    // two readings of the same silicon, and the bench decides which.
    ewi_count = 0;
    Wwdg::clear_flag();
    Nvic::clear_pending(Wwdg::irq());
    Nvic::enable(Wwdg::irq());
    (void)Wwdg::configure(WwdgConfig{WwdgPrescaler::div8, 0x7F, true});
    Wwdg::refresh(0x7F);
    const uint32_t c2 = cycles_now();
    while (ewi_count == 0u && cycles_now() - c2 < SysClock::hz / 4u) {
    }
    const uint16_t fired = ewi_count;
    const bool flag_after = Wwdg::flag();
    print(serial, "  EWI enabled, WDGA still clear: the handler ran ", fired,
          " time(s) in 250 ms; EWIF=", flag_after, crlf);
    bench.verdict("the early-wakeup INTERRUPT does NOT fire while WDGA is "
                  "clear, though EWIF does rise - 22.2's parenthetical is right "
                  "and 22.6.2's bit description is incomplete",
                  fired == 0u && flag_after);

    // The vector and the ISR body are still exercised, by pending the
    // line by hand over a flag the counter really raised: what the
    // handler does with it is the same code either way, and letter i's
    // last leg is where the hardware request itself is proven (with the
    // watchdog activated, on the reset it was going to cause anyway).
    Nvic::set_pending(Wwdg::irq());
    const uint32_t c3 = cycles_now();
    while (ewi_count == 0u && cycles_now() - c3 < SysClock::hz / 100u) {
    }
    bench.verdict("pending the line by hand runs the bound handler", ewi_count != 0u);
    bench.verdict("and the ISR body acknowledged the flag (EWIF is down)",
                  !Wwdg::flag());
    Nvic::disable(Wwdg::irq());
    Nvic::clear_pending(Wwdg::irq());

    bench.verdict("EWI is one-way: a configuration that asks for it off cannot "
                  "take it back (22.6.2, set by software and cleared by "
                  "hardware after a reset)",
                  (Wwdg::configure(WwdgConfig{WwdgPrescaler::div8, 0x7F, false}),
                   Wwdg::early_wakeup_enabled()));

    // Park it slow, so the free-running counter's flag costs as little
    // as possible for the rest of the session.
    (void)Wwdg::configure(WwdgConfig{WwdgPrescaler::div8, 0x7F, false});
    Wwdg::clear_flag();
    bench.verdict("the board is left with WDGA still clear", !Wwdg::enabled());
}

// =============================================================================
// d - the fault vectors, without faulting
// =============================================================================
void td_faults() {
    print(serial, "  at boot: SHCSR=", hex(boot_shcsr), " CFSR=", hex(boot_fault.cfsr),
          " HFSR=", hex(boot_fault.hfsr), crlf);
    bench.verdict("the three configurable faults are DISABLED at reset, so "
                  "every fault escalates to HardFault until a program says "
                  "otherwise (PM0214 4.3.10)",
                  (boot_shcsr & (SCB_SHCSR_MEMFAULTENA_Msk | SCB_SHCSR_BUSFAULTENA_Msk |
                                 SCB_SHCSR_USGFAULTENA_Msk)) == 0u);
    bench.verdict("and a clean boot's fault status is empty", boot_fault.empty());

    Faults::enable(true, true, true);
    const bool all_on = Faults::mem_enabled() && Faults::bus_enabled() && Faults::usage_enabled();
    Faults::enable(false, true, false);
    const bool bus_only = !Faults::mem_enabled() && Faults::bus_enabled() && !Faults::usage_enabled();
    Faults::enable(false, false, false);
    const bool all_off = !Faults::mem_enabled() && !Faults::bus_enabled() && !Faults::usage_enabled();
    print(serial, "  SHCSR after enable(1,1,1) / (0,1,0) / (0,0,0): ", all_on, " ",
          bus_only, " ", all_off, crlf);
    bench.verdict("the three enables are independent and both ways",
                  all_on && bus_only && all_off);

    const bool div_was = Faults::divide_by_zero_trap();
    const bool unalign_was = Faults::unaligned_trap();
    Faults::divide_by_zero_trap(true);
    Faults::unaligned_trap(true);
    const bool traps_on = Faults::divide_by_zero_trap() && Faults::unaligned_trap();
    Faults::divide_by_zero_trap(false);
    Faults::unaligned_trap(false);
    const bool traps_off = !Faults::divide_by_zero_trap() && !Faults::unaligned_trap();
    print(serial, "  CCR=", hex(SCB->CCR), " (DIV_0_TRP and UNALIGN_TRP were ",
          div_was, " and ", unalign_was, " at entry)", crlf);
    bench.verdict("the two CCR traps arm and disarm - a divide by zero and an "
                  "unaligned access are UsageFaults only when they are on",
                  traps_on && traps_off);
    Faults::divide_by_zero_trap(div_was);
    Faults::unaligned_trap(unalign_was);

    // The status registers, still with nothing having faulted: read is
    // non-destructive, clear takes down what stands, and the record's
    // predicates decode the words the core would have written.
    const FaultRecord r = Faults::read();
    Faults::clear();
    const FaultRecord after = Faults::read();
    bench.verdict("reading the fault status changes nothing and clearing it "
                  "leaves it empty",
                  r.empty() && after.empty() && !after.address_valid());
    bench.verdict("the record decodes the core's own bit positions",
                  FaultRecord{SCB_CFSR_DIVBYZERO_Msk, 0, 0}.usage_fault() &&
                      !FaultRecord{SCB_CFSR_DIVBYZERO_Msk, 0, 0}.mem_fault() &&
                      FaultRecord{0, SCB_HFSR_FORCED_Msk, 0}.escalated());

    // The boot state is restored: this letter must leave the board as
    // any other program would find it.
    bench.verdict("the letter leaves the three faults disabled, as the reset "
                  "left them",
                  (SCB->SHCSR & (SCB_SHCSR_MEMFAULTENA_Msk | SCB_SHCSR_BUSFAULTENA_Msk |
                                 SCB_SHCSR_USGFAULTENA_Msk)) == 0u);
}

