uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
// =============================================================================
// i - seven real resets (outside z: it reboots the board)
// =============================================================================

/// The IWDG setting leg 2 arms: deliberately NOT the reset one - /8 with
/// a reload of 0x0EEE instead of /4 with 0x0FFF - so that the time-out
/// itself says whether the configuration landed (955 ms nominal against
/// the 512 ms an unconfigured watchdog would take).
constexpr IwdgPrescaler leg_prescaler = IwdgPrescaler::div8;
constexpr uint16_t leg_reload = 0x0EEE;
/// RL + 1 counts at LSI / 8, so an elapsed time in milliseconds IS the
/// LSI: f = (RL + 1) x 8 x 1000 / ms.
constexpr uint32_t leg_lsi_numerator = (leg_reload + 1UL) * 8UL * 1000UL;
/// How long the boot after that reset sits with nothing refreshing: three
/// time-outs, so a watchdog the reset did not stop cannot fail to bite.
constexpr uint32_t quiet_ms = 3000;

void bank(uint8_t leg) {
    token.magic = token_magic;
    token.canary = token_canary;
    token.leg = leg;
    token.pass = bench.passed();
    token.fail = bench.failed();
    token.flags_before = Reset::flags();
}

/// Announce a leg, get the words out, and never come back.
[[noreturn]] void await_reset(const char* what) {
    print(serial, "  ", what, crlf);
    console_drain();
    for (;;) {
        service();
    }
}

/// Leg 1: the CPU's own SYSRESETREQ, with the flags cleared first so the
/// next boot sees exactly what this reset raises and nothing else.
[[noreturn]] void leg_software() {
    bank(1);
    print(serial, "  leg 1: Reset::software() with the flags cleared first ...", crlf);
    console_drain();
    Reset::clear_flags();
    token.flags_before = 0;
    Reset::software();
}

/// Leg 2: an IWDG time-out, MEASURED - and the LSI with it.
///
/// The flags are deliberately NOT cleared, so the next boot is also
/// where the accumulation question is settled; and the elapsed
/// milliseconds banked in .noinit turn a reboot into a measurement.
[[noreturn]] void leg_iwdg() {
    bank(2);
    token.quiet = Quiet::untried;
    print(serial, "  leg 2: the IWDG at /8 with reload 0xEEE (",
          iwdg_nominal_ms(leg_prescaler, leg_reload),
          " ms nominal, against 512 unconfigured), flags left standing ...", crlf);
    console_drain();

    token.elapsed_ms = 0;
    token.armed = Iwdg::arm(IwdgConfig{leg_prescaler, leg_reload}) ? 1u : 0u;
    // THE WITNESS IN ITS POSITIVE DIRECTION, which no letter of `z` can
    // reach: with the watchdog live and LSION never written, the LSI is
    // forced on and Iwdg::running() must say so (7.2.9).
    token.armed_running = Iwdg::running() ? 1u : 0u;
    // THROUGH A VOLATILE POINTER, and it is not decoration: a plain
    // store to a non-volatile object inside a loop that never exits is
    // one gcc is entitled to sink out of the loop - which is to say,
    // never to perform, and the leg then banks a beautiful zero.
    volatile uint32_t* const elapsed = &token.elapsed_ms;
    const uint32_t t0 = Ticker::ticks();
    for (;;) {
        *elapsed = Ticker::ticks() - t0;
    }
}

/// Leg 3: a WWDG WINDOW VIOLATION - a refresh made while the counter is
/// above the window - with the flags cleared first, so the next boot
/// also proves RMVF really took the previous ones down.
[[noreturn]] void leg_wwdg_window() {
    bank(3);
    print(serial, "  leg 3: the WWDG refreshed ABOVE its window, flags cleared "
          "first ...", crlf);
    console_drain();
    Reset::clear_flags();
    token.flags_before = 0;

    Wwdg::bus_clock(true);
    (void)Wwdg::configure(WwdgConfig{WwdgPrescaler::div1, 0x40, false});
    Wwdg::start(0x7F);    // 0x7F is above W: the refresh below is illegal
    Wwdg::refresh(0x7F);
    await_reset("(waiting for the violation to land)");
}

/// Leg 4: panic() with the reporter that resets, so the breadcrumb has
/// to survive a system reset to be read at all.
[[noreturn]] void leg_panic() {
    token.code = static_cast<uint8_t>(PanicCode::assert_failed);
    token.context = 0x5A;
    bank(4);
    print(serial, "  leg 4: panic() through ResetReporter, flags cleared first ...",
          crlf);
    console_drain();
    Reset::clear_flags();
    token.flags_before = 0;
    panic<P, ResetReporter>(PanicCode::assert_failed, 0x5A);
}

/// Leg 5: a deliberate HardFault, caught by hard_fault_reset().
///
/// UDF, and it has to be UDF: the permanently-undefined instruction is
/// the one thing no compiler can turn into something legal. With the
/// three configurable faults disabled - the state every boot starts in -
/// it is a UsageFault that ESCALATES, so HFSR.FORCED must stand beside
/// UFSR.UNDEFINSTR in the record the handler banks.
[[noreturn]] void leg_fault() {
    token.code = static_cast<uint8_t>(PanicCode::kernel_fault);
    token.context = 0x77;
    token.fault_cfsr = 0;
    token.fault_hfsr = 0;
    bank(5);
    print(serial, "  leg 5: UDF -> HardFault -> hard_fault_reset() ...", crlf);
    console_drain();
    __asm__ volatile("udf #0");
    await_reset("(the undefined instruction did not fault)");
}

/// Leg 6: the same wreck at ITS OWN VECTOR - a divide by zero with
/// DIV_0_TRP armed and UsageFault enabled, so the core takes
/// UsageFault_Handler instead of escalating.
volatile int32_t zero_divisor = 0;
volatile int32_t quotient = 0;

[[noreturn]] void leg_usage_fault() {
    token.code = static_cast<uint8_t>(PanicCode::kernel_fault);
    token.context = 0x66;
    token.fault_cfsr = 0;
    token.fault_hfsr = 0;
    bank(6);
    print(serial, "  leg 6: a divide by zero with DIV_0_TRP and USGFAULTENA on "
          "-> UsageFault ...", crlf);
    console_drain();
    Faults::enable(false, false, true);
    Faults::divide_by_zero_trap(true);
    quotient = 100 / zero_divisor;
    await_reset("(the divide by zero did not fault)");
}

/// Leg 7: the WWDG left to run down to 0x3F with nothing refreshing it,
/// its early warning armed on the way.
[[noreturn]] void leg_wwdg_timeout() {
    bank(7);
    token.ewi_seen = 0;
    token.ewi_counter = 0;
    print(serial, "  leg 7: the WWDG activated, its EARLY WARNING armed, and "
          "never refreshed ...", crlf);
    console_drain();
    Wwdg::bus_clock(true);
    Wwdg::clear_flag();
    Nvic::clear_pending(Wwdg::irq());
    Nvic::enable(Wwdg::irq());
    // THE ONE PLACE THE HARDWARE EWI REQUEST CAN BE PROVEN WITHOUT
    // COSTING ANYTHING. Activating the WWDG is one-way (22.3), so no
    // letter of `z` may do it - but this leg is about to be reset by
    // that very watchdog, so the activation costs nothing here. The
    // handler banks what it saw in .noinit and does NOT refresh: the
    // reset follows one step later, which is the point.
    (void)Wwdg::configure(WwdgConfig{WwdgPrescaler::div8, 0x7F, true});
    Wwdg::start(0x7F);
    await_reset("(waiting for the warning, then the counter reaching 0x3F)");
}

