uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
void ti_resets() {
    report_boot();
    bench.verdict("this boot names a reset source", (boot_flags & ResetFlag::all) != 0u);
    bench.verdict("no panic record is pending on a clean start", !boot_record);
    print(serial, "  NOTE: leg 2 starts the IWDG, and nothing in software can "
          "stop it (RM0090 21.3) - whether the reset it causes does is the "
          "leg's own measurement", crlf);
    leg_software();
}

/// Everything after a reset. Called from main() instead of the banner,
/// and it either starts the next leg (never returning) or closes the
/// letter.
void ti_resume() {
    bench.resume_tally(token.pass, token.fail);

    const uint8_t leg = token.leg;
    print(serial, crlf, "i (continued after reset ", leg, " of 7)", crlf);
    report_boot();

    if (leg == 1) {
        bench.verdict("Reset::software() resets the device and raises SFTRSTF",
                      (boot_flags & ResetFlag::software) != 0u);
        // WHAT A SOFTWARE RESET RAISES BESIDE ITS OWN BIT. 7.3.21
        // describes PINRSTF as the NRST pin's, but the pad is driven by
        // the internal sources too - this is the leg that shows what
        // this silicon really does, with the flags cleared a moment
        // before and the pin untouched.
        print(serial, "  a software reset raised: ");
        print_flags(boot_flags);
        print(serial, crlf);
        bench.verdict("PINRSTF is raised BY THE SOFTWARE RESET TOO - the NRST "
                      "pad is driven by the internal sources, so the bit names "
                      "the pin only when it stands alone",
                      (boot_flags & ResetFlag::pin) != 0u);
        bench.verdict("and nothing else came with them - no supply flag, no "
                      "watchdog",
                      (boot_flags & ~(ResetFlag::software | ResetFlag::pin)) == 0u);
        leg_iwdg();
    }

    if (leg == 2) {
        // THE MEASUREMENT: the elapsed milliseconds ARE the LSI.
        const uint32_t ms = token.elapsed_ms;
        const uint32_t lsi = ms != 0u ? leg_lsi_numerator / ms : 0u;
        print(serial, "  the IWDG bit after ", ms, " ms of kernel tick (",
              iwdg_nominal_ms(leg_prescaler, leg_reload),
              " nominal, 512 if nothing had landed); arm() answered ",
              token.armed != 0u ? "true" : "false", "; LSI = ", lsi, " Hz", crlf);
        bench.verdict("an IWDG time-out resets the device",
                      (boot_flags & ResetFlag::independent_watchdog) != 0u);
        bench.verdict("arm() reported the configuration landed",
                      token.armed != 0u);
        bench.verdict("and with the watchdog live Iwdg::running() read TRUE - "
                      "the start forced the LSI on with LSION never written, "
                      "which is the witness in the direction `z` cannot reach",
                      token.armed_running != 0u);
        bench.verdict("and the time-out proves it on the wall clock: it is the "
                      "configured 955 ms nominal and not the 512 ms an "
                      "unconfigured watchdog would take",
                      ms >= 860u && ms <= 1100u);
        bench.verdict("the LSI it implies is inside the datasheet's 17..47 kHz",
                      lsi >= 17'000u && lsi <= 47'000u);

        // THE ACCUMULATION QUESTION, ANSWERED. This leg did not clear
        // the flags, so leg 1's SFTRSTF must still be standing beside
        // the new IWDGRSTF.
        print(serial, "  flags standing when the leg started: ");
        print_flags(token.flags_before);
        print(serial, crlf);
        bench.verdict("THE FLAGS ACCUMULATE: leg 1's SFTRSTF is still here "
                      "beside the new IWDGRSTF, because nothing wrote RMVF in "
                      "between (7.3.21 - a history, not a cause)",
                      (boot_flags & ResetFlag::software) != 0u &&
                          (boot_flags & ResetFlag::independent_watchdog) != 0u);

        // THE OTHER READING OF "IT CANNOT BE STOPPED". RM0090 5.3.4 ends
        // the sentence with "except by a Reset" - if the reset the
        // watchdog itself caused is such a reset, this boot can sit
        // still for three time-outs and live. THE SILENCE IS THE
        // MEASUREMENT, and it is banked before it starts so that a boot
        // which finds it "trying" knows the silence killed it.
        print(serial, "  LSI witness at this boot: LSION=", boot_lsi_on, " LSIRDY=",
              boot_lsi_ready, " -> Iwdg::running() would read ",
              boot_lsi_ready && !boot_lsi_on, crlf);
        if (token.quiet == Quiet::untried) {
            print(serial, "  sitting still for ", quiet_ms,
                  " ms with NOTHING refreshing the watchdog ...", crlf);
            console_drain();
            token.quiet = Quiet::trying;
            const uint32_t q0 = Ticker::ticks();
            while (Ticker::ticks() - q0 < quiet_ms) {
            }
            token.quiet = Quiet::survived;
        } else if (token.quiet == Quiet::trying) {
            token.quiet = Quiet::bitten;
        }
        const bool stopped = token.quiet == Quiet::survived;
        print(serial, "  ... the board ", stopped ? "LIVED" : "was reset again",
              crlf);
        bench.verdict("THE RESET STOPPED IT: a boot after an IWDG reset outlives "
                      "three of its own time-outs with nobody feeding it, so "
                      "'cannot be stopped except by a Reset' (5.3.4) is literal "
                      "and a program does not inherit a watchdog for ever",
                      stopped);
        // Whichever way it went, the rest of the letter must measure its
        // own legs and not this watchdog.
        feed_iwdg = !stopped;
        leg_wwdg_window();
    }

    if (leg == 3) {
        bench.verdict("a WWDG refresh above the window resets the device",
                      (boot_flags & ResetFlag::window_watchdog) != 0u);
        bench.verdict("RMVF really took the earlier flags down: neither SFTRSTF "
                      "nor IWDGRSTF is standing",
                      (boot_flags &
                       (ResetFlag::software | ResetFlag::independent_watchdog)) == 0u);
        bench.verdict("the WWDG came back DISABLED (WDGA is cleared by the "
                      "reset - 22.6.1)",
                      !Wwdg::enabled());
        bench.verdict("and its bus clock came back OFF with it, as a reset "
                      "leaves every APB1 enable",
                      !boot_wwdg_clocked);
        leg_panic();
    }

    if (leg == 4) {
        // NOTE what had to happen for this to work at all: panic() ends
        // in break_here(), which is BKPT, and with no debugger attached
        // that escalates into HardFault_Handler - so the reset here may
        // have come from ResetReporter or from hard_fault_reset(), and
        // either way the RECORD must still say what panic() reported.
        // That is why the fault body refuses to overwrite a valid one.
        bench.verdict("a panic through ResetReporter resets the device",
                      (boot_flags & ResetFlag::software) != 0u);
        bench.verdict("the breadcrumb survived the reset (SRAM is promised "
                      "nowhere, so this is a measurement)",
                      boot_record.has_value());
        bench.verdict("its code is the one panic() was given",
                      boot_record && boot_record->code == token.code);
        bench.verdict("its context byte came through untouched",
                      boot_record && boot_record->context == token.context);
        bench.verdict("a software reset and a watchdog reset are "
                      "DISTINGUISHABLE at the next boot",
                      (boot_flags & ResetFlag::watchdog) == 0u);
        leg_fault();
    }

