uliano/brio/stm32f4/src/apps/test_stm32f4_reset.cpp
    if (leg == 5) {
        const FaultRecord r{token.fault_cfsr, token.fault_hfsr, token.fault_address};
        print(serial, "  the wreck as the handler read it: CFSR=", hex(r.cfsr),
              " HFSR=", hex(r.hfsr), " address=", hex(r.address), crlf);
        bench.verdict("a HardFault reaches hard_fault_reset() and resets",
                      (boot_flags & ResetFlag::software) != 0u);
        bench.verdict("the record it left says kernel_fault",
                      boot_record && boot_record->code == token.code);
        bench.verdict("with the context byte the body was given",
                      boot_record && boot_record->context == token.context);
        bench.verdict("and the FAULT record says what the core saw: an "
                      "undefined instruction, ESCALATED to HardFault because "
                      "UsageFault was disabled (HFSR.FORCED)",
                      r.usage_fault() && (r.cfsr & SCB_CFSR_UNDEFINSTR_Msk) != 0u &&
                          r.escalated());
        leg_usage_fault();
    }

    if (leg == 6) {
        const FaultRecord r{token.fault_cfsr, token.fault_hfsr, token.fault_address};
        print(serial, "  the wreck as the handler read it: CFSR=", hex(r.cfsr),
              " HFSR=", hex(r.hfsr), " address=", hex(r.address), crlf);
        bench.verdict("a UsageFault reaches its OWN vector when SHCSR enables "
                      "it, and the same body resets from there",
                      (boot_flags & ResetFlag::software) != 0u);
        bench.verdict("the record says kernel_fault with this leg's context",
                      boot_record && boot_record->code == token.code &&
                          boot_record->context == token.context);
        bench.verdict("CFSR names the divide by zero (UFSR.DIVBYZERO), which "
                      "only DIV_0_TRP makes a fault at all",
                      (r.cfsr & SCB_CFSR_DIVBYZERO_Msk) != 0u);
        bench.verdict("and NOTHING escalated: an enabled configurable fault is "
                      "taken at its own vector, so HFSR.FORCED is clear",
                      !r.escalated());
        bench.verdict("the enables did not survive the reset: SHCSR is back at "
                      "its reset value",
                      (boot_shcsr & SCB_SHCSR_USGFAULTENA_Msk) == 0u);
        leg_wwdg_timeout();
    }

    // leg 7: the last boot.
    bench.verdict("a WWDG counter reaching 0x3F resets the device",
                  (boot_flags & ResetFlag::window_watchdog) != 0u);
    print(serial, "  the early warning ", token.ewi_seen ? "FIRED" : "did not fire",
          " on the way down; the counter read ", hex(token.ewi_counter),
          " inside its handler", crlf);
    bench.verdict("with the watchdog ACTIVATED the early-wakeup interrupt really "
                  "is requested - the half letter c cannot stage, paid for by a "
                  "reset that was going to happen anyway",
                  token.ewi_seen != 0u);
    bench.verdict("and it fired at the warning value: the counter it saw was "
                  "0x40 or the 0x3F it was about to become",
                  token.ewi_counter == 0x40u || token.ewi_counter == 0x3Fu);
    bench.verdict("the token crossed all seven resets intact",
                  token.magic == token_magic && token.canary == token_canary);

    token.leg = 0;
    token.magic = 0;
    bench.end_letter();
}

// =============================================================================
// The menu
// =============================================================================
void banner() {
    print(serial, crlf, "test_stm32f4_reset - the reset flags, both watchdogs "
          "and the fault vectors (RM0090 7.3.21, ch. 21, ch. 22, PM0214 4.3), "
          "clk=", SysClock::hz, " Hz", crlf);
    bench.menu();
}

} // namespace

// ---- target glue ------------------------------------------------------------
//
// An unbound vector here is a SILENT death - the crt's default handler
// is a spin loop - so every line this suite can raise is bound.
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif

extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

extern "C" void WWDG_IRQHandler() {
    const uint8_t t = brio::Wwdg::counter();
    if (brio::Wwdg::isr()) {
        ewi_count = static_cast<uint16_t>(ewi_count + 1);
        if (token.magic == token_magic && token.leg == 7) {
            token.ewi_seen = 1;
            token.ewi_counter = t;
        }
    }
}

/// The whole point of stm32f4/reset.hpp's fault body: a crash becomes a
/// note the next boot can read, instead of a spin nobody sees. The
/// STATUS registers are read into the suite's own token first - the
/// driver owns no storage for them, by design - and then the body writes
/// the panic record and resets.
static void bank_fault_and_reset() {
    const brio::FaultRecord r = brio::Faults::take();
    if (token.magic == token_magic) {
        token.fault_cfsr = r.cfsr;
        token.fault_hfsr = r.hfsr;
        token.fault_address = r.address;
    }
    brio::hard_fault_reset<P>(token.context);
}

extern "C" void HardFault_Handler() { bank_fault_and_reset(); }
extern "C" void UsageFault_Handler() { bank_fault_and_reset(); }

int main() {
    // Sampled FIRST: the flags are not cleared by reading, but the panic
    // record is fetch-and-clear and must be taken exactly once.
    boot_flags = brio::Reset::flags();
    boot_record = brio::take_panic_record<P>();
    boot_lsi_on = brio::Rcc::lsi_enabled();
    boot_lsi_ready = brio::Rcc::lsi_ready();
    boot_wwdg_clocked = brio::Wwdg::bus_clock();
    boot_shcsr = SCB->SHCSR;
    boot_fault = brio::Faults::read();

    // A watchdog letter i left running - if the reset it caused did not
    // stop it - must be fed from here on, or the legs after it measure
    // its bite instead of their own. Refreshing a stopped watchdog is
    // nothing at all, so this is safe on every boot.
    if (token.magic == token_magic && token.leg != 0) {
        brio::Iwdg::refresh();
    }

